### Simulation des changements d'infrastruture Terraform sur scalingo-recette
#### Format et Style du code Terraform 🖌 : ✅
#### Validation de la configuration de Terraform (`validate`) 🤖 : ✅
<details><summary>Montrer le résultat de la validation</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 : ✅

<details><summary>Montrer les modifications prévues par Terraform</summary>

```

terraform
data.statuscake_contact_group.default_contact_group: Reading...
module.front_app.data.environment_variables.scalingo_region_env: Reading...
data.cloudflare_zone.zone: Reading...
module.front_app.data.environment_variables.scalingo_region_env: Read complete after 0s [id=11f66ba2-f773-61d6-7331-d1b230ac4038]
data.dotenv.envs_du_fichier_env: Reading...
data.dotenv.envs_du_fichier_env: Read complete after 0s [id=��~����w�%Fǥ�MBd\]
data.cloudflare_zone.zone: Read complete after 0s [id=2df6de52b2ef58de5641d2f2f6b55e78]
cloudflare_record.domaine_analytics_eulerian["yssn.recette.1jeune1solution.gouv.fr"]: Refreshing state... [id=f6fb41d9ffcc10db04678dc58d419850]
data.statuscake_contact_group.default_contact_group: Read complete after 1s [id=286221]
module.front_app.data.scalingo_scm_integration.scm_integration["github"]: Reading...
module.front_app.data.scalingo_stack.stack: Reading...
module.front_app.data.scalingo_scm_integration.scm_integration["github"]: Read complete after 1s [id=8abb0726-3707-456b-823c-f119d20740aa]
module.front_app.data.scalingo_stack.stack: Read complete after 1s [id=st-528ed067-917a-4931-875a-40b7500c724a]
module.front_app.scalingo_app.app: Refreshing state... [id=6245cca7623d3a000e9b9517]
module.front_app.scalingo_container_type.containers["web"]: Refreshing state... [id=1j1s-front:web]
module.front_app.scalingo_domain.canonical_domain["recette.1jeune1solution.gouv.fr"]: Refreshing state... [id=64d2081761d7b2000fbf653f]
module.front_app.scalingo_log_drain.log_drain["elk"]: Refreshing state... [id=8cc87c3126e15f8e92570811ce549d5815989e34bbdeb7195b91ffa0030da85a]
module.front_app.scalingo_scm_repo_link.scm_repo_link["github"]: Refreshing state... [id=6245cca7623d3a000e9b9517]
module.front_app.scalingo_addon.addons["redis"]: Refreshing state... [id=ad-102bc06d-ebc2-4324-a80a-7f030608cec6]
cloudflare_record.domaine["recette.1jeune1solution.gouv.fr"]: Refreshing state... [id=6ac534541aae643b4c638fdf2a4d84f6]
statuscake_uptime_check.http_check: Refreshing state... [id=6673787]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.front_app.scalingo_addon.addons["redis"] must be replaced
-/+ resource "scalingo_addon" "addons" {
      ~ app               = "1j1s-front" -> "6245cca7623d3a000e9b9517" # forces replacement
      ~ id                = "ad-102bc06d-ebc2-4324-a80a-7f030608cec6" -> (known after apply)
      ~ plan_id           = "5cc45b2218e5470015111bf0" -> (known after apply)
      ~ resource_id       = "1j1s-front-7367" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.front_app.scalingo_container_type.containers["web"] must be replaced
-/+ resource "scalingo_container_type" "containers" {
      ~ app    = "1j1s-front" -> "6245cca7623d3a000e9b9517" # forces replacement
      ~ id     = "1j1s-front:web" -> (known after apply)
        name   = "web"
        # (2 unchanged attributes hidden)
    }

  # module.front_app.scalingo_domain.canonical_domain["recette.1jeune1solution.gouv.fr"] must be replaced
-/+ resource "scalingo_domain" "canonical_domain" {
      ~ app         = "1j1s-front" -> "6245cca7623d3a000e9b9517" # forces replacement
      ~ id          = "64d2081761d7b2000fbf653f" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.front_app.scalingo_log_drain.log_drain["elk"] must be replaced
-/+ resource "scalingo_log_drain" "log_drain" {
      ~ app       = "1j1s-front" -> "6245cca7623d3a000e9b9517" # forces replacement
      ~ drain_url = (sensitive value)
      ~ id        = "8cc87c3126e15f8e92570811ce549d5815989e34bbdeb7195b91ffa0030da85a" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Pour appliquer les changements proposés par ce plan :
- en recette : il suffit de merger cette PR
- en production : il faut merger la PR de release (créée par release-please)

*Environnement: `scalingo-recette`, Auteur: @josephpage, Répertoire: `./terraform`*